app/views/certificates/_form.html.erb

    <%= f.label :personal_id %><br>
    <%= collection_select(:certificate, :personal_id, Personal.all, :id, :nombre_apellido, include_blank: :true) %>
---
SELECT `personals`.* FROM `personals`