app/controllers/certificates_controller.rb

  def show
    @certificate = Certificate.find(params[:id])
---
SELECT  `certificates`.* FROM `certificates` WHERE `certificates`.`id` = 980190962 LIMIT 1

    def set_certificate
      @certificate = Certificate.find(params[:id])
---
SELECT  `certificates`.* FROM `certificates` WHERE `certificates`.`id` = 980190962 LIMIT 1