app/controllers/liquidacions_controller.rb

SELECT `liquidacions`.* FROM `liquidacions`
---
  def index
    if current_user and current_user.tipo_usuario == "Administrador"
      @liquidacions = Liquidacion.all

SELECT  `liquidacions`.* FROM `liquidacions` WHERE `liquidacions`.`id` = 980190962 LIMIT 1
---
  def show
    @liquidacion = Liquidacion.find(params[:id])