app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`rut_usuario` IS NULL LIMIT 1
---
  def create
    user = User.find_by_rut_usuario(params[:rut_usuario])