app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL  ORDER BY `users`.`id` ASC LIMIT 1
---
    def set_user
      @user = User.find(params[:id])